app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]

  def import
    file = params[:file]
    return redirect_to posts_path, notice: 'only CSV File to be supported' unless file.content_type == 'text/csv'
    file = File.open(file)
    csv = CSV.parse(file, headers: true, col_sep: ";")
    csv.each do |row|
      post_hash = {}
      post_hash[:title] = row['title']
      post_hash[:body] = row['body']
      Post.create(post_hash)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", nil], ["body", nil], ["created_at", "2023-02-07 20:46:09.412350"], ["updated_at", "2023-02-07 20:46:09.412350"]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hey buddy"], ["body", "jkwhdfj"], ["created_at", "2023-02-16 18:08:16.335201"], ["updated_at", "2023-02-16 18:08:16.335201"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "tried"], ["body", "from loading the data trough CSV"], ["updated_at", "2023-02-07 20:47:31.500683"], ["id", 5]]